# import excel file

https://www.youtube.com/watch?v=hT4b9vFZRB0

In [181]:
import pandas as pd

In [182]:
pd.read_excel('pandas.xlsx')

  Unnamed: 0     City Country  Math  Science
0       John   Mumbai   India    42        6
1      Alice   London      UK    13       77
2        Bob   London      UK    43       59
3       Mary  Florida     USA    26       49
4      Krish   Madrid   Spain    82       58

In [183]:
pd.read_excel('pandas.xlsx',index_col=0)  # Now we can search through data using the names of students

          City Country  Math  Science
John    Mumbai   India    42        6
Alice   London      UK    13       77
Bob     London      UK    43       59
Mary   Florida     USA    26       49
Krish   Madrid   Spain    82       58

In [184]:
pd.read_excel('pandas.xlsx',index_col=0,header=0) # Tells the row number where header\labels are

          City Country  Math  Science
John    Mumbai   India    42        6
Alice   London      UK    13       77
Bob     London      UK    43       59
Mary   Florida     USA    26       49
Krish   Madrid   Spain    82       58

In [185]:
pd.read_excel('pandas.xlsx',index_col=0,header=0,usecols="A:C") # Read only the A to C columns in the sheet

          City Country
John    Mumbai   India
Alice   London      UK
Bob     London      UK
Mary   Florida     USA
Krish   Madrid   Spain

In [186]:
pd.read_excel('pandas.xlsx',index_col=0,header=0,names=["Name","City","Country","Math","Science"]) # Give custom names to the extracted columns
# You can see here that the index column is printed differently

          City Country  Math  Science
Name
John    Mumbai   India    42        6
Alice   London      UK    13       77
Bob     London      UK    43       59
Mary   Florida     USA    26       49
Krish   Madrid   Spain    82       58

In [187]:
pd.read_excel('pandas.xlsx',index_col=0,header=0,usecols=[0,2,4]) # Use only certain columns based on column number

      Country  Science
John    India        6
Alice      UK       77
Bob        UK       59
Mary      USA       49
Krish   Spain       58

In [188]:
pd.read_excel('pandas.xlsx',index_col=0,header=0,sheet_name=1) # Read a particular sheet in the workbook

             City    Country Degree Specialization
Manish     Mumbai      India    MSC          Maths
Chowdary    Delhi      India     BA        Physics
Chow        Perth  Australia    PHD          Maths
David     Colombo   Srilanka    BBM       Pharmacy
Samuel    Newyork        USA    BSC       Medicine

In [189]:
pd.read_excel('pandas.xlsx',index_col=0,header=0,sheet_name="teacher") # Read a particular sheet in the workbook

             City    Country Degree Specialization
Manish     Mumbai      India    MSC          Maths
Chowdary    Delhi      India     BA        Physics
Chow        Perth  Australia    PHD          Maths
David     Colombo   Srilanka    BBM       Pharmacy
Samuel    Newyork        USA    BSC       Medicine

In [190]:
pd.read_excel('pandas.xlsx',index_col=0,header=0,sheet_name="teacher",skiprows=[0,1]) # Skip certain rows
# The headers are all wrong here

            Delhi      India   BA   Physics
Chowdary
Chow        Perth  Australia  PHD     Maths
David     Colombo   Srilanka  BBM  Pharmacy
Samuel    Newyork        USA  BSC  Medicine

In [191]:
pd.read_excel('pandas.xlsx',index_col=0,header=0,sheet_name="teacher",skiprows=[0,1],names=["Name","City","Country","Degree","Specialization"]) 
# Give custom header/labels

           City    Country Degree Specialization
Name
Chow      Perth  Australia    PHD          Maths
David   Colombo   Srilanka    BBM       Pharmacy
Samuel  Newyork        USA    BSC       Medicine

In [192]:
teacher = pd.read_excel('pandas.xlsx',index_col=0,header=0,sheet_name="teacher")

In [193]:
teacher

             City    Country Degree Specialization
Manish     Mumbai      India    MSC          Maths
Chowdary    Delhi      India     BA        Physics
Chow        Perth  Australia    PHD          Maths
David     Colombo   Srilanka    BBM       Pharmacy
Samuel    Newyork        USA    BSC       Medicine

In [194]:
teacher.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Manish to Samuel
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   City            5 non-null      object
 1   Country         5 non-null      object
 2   Degree          5 non-null      object
 3   Specialization  5 non-null      object
dtypes: object(4)
memory usage: 100.0+ bytes

In [195]:
teacher.head(2)

            City Country Degree Specialization
Manish    Mumbai   India    MSC          Maths
Chowdary   Delhi   India     BA        Physics

In [196]:
#teacher.to_csv("teacher.csv")

# Video 2

https://www.youtube.com/watch?v=6whF-Vzuots

https://www.youtube.com/watch?v=wjPgszCLdYY

In [197]:
student=pd.read_excel('pandas.xlsx',sheet_name="student",index_col=0,header=0,names=["Name","City","Country","Math","Science"])

In [198]:
student

          City Country  Math  Science
Name
John    Mumbai   India    42        6
Alice   London      UK    13       77
Bob     London      UK    43       59
Mary   Florida     USA    26       49
Krish   Madrid   Spain    82       58

In [199]:
pd.read_excel('pandas.xlsx',sheet_name="student",index_col=0,header=0,nrows=2) # Give number of rows to be read

         City Country  Math  Science
John   Mumbai   India    42        6
Alice  London      UK    13       77

In [200]:
student.iloc[[0,2,4]]
# iloc is index locator for integer index
# iloc = [0,1] for 0th index 1st index i.e. 0 and 1 column numbers
# loc is for locating non-integer index
# loc=['Column1','Column2'] where column1, column2 are names of the columns

         City Country  Math  Science
Name
John   Mumbai   India    42        6
Bob    London      UK    43       59
Krish  Madrid   Spain    82       58

In [201]:
student.loc[['Alice','Krish']]

         City Country  Math  Science
Name
Alice  London      UK    13       77
Krish  Madrid   Spain    82       58

In [202]:
student.iloc[0,1] # To get a particular attribute of an index (if the index is an integer)

'India'

In [203]:
student.loc['Alice','City'] # To get a particular attribute of an index (if the index is a non-integer)

'London'

In [204]:
student.iloc[:,2]>30   # index slicing for getting the boolean values based on condition

Name
John      True
Alice    False
Bob       True
Mary     False
Krish     True
Name: Math, dtype: bool

In [205]:
student.iloc[:,2]>30    # generates a true and false table
# student[Boolean list] will returns only the rows which are true

Name
John      True
Alice    False
Bob       True
Mary     False
Krish     True
Name: Math, dtype: bool

In [206]:
student[student.iloc[:,2]>30]    # Getting the rows based on condition
# student[Boolean list] will returns only the rows which are true

         City Country  Math  Science
Name
John   Mumbai   India    42        6
Bob    London      UK    43       59
Krish  Madrid   Spain    82       58

In [207]:
student[~(student.iloc[:,2]>30)] 
# Using not condition in pandas, here we get students whose math marks are not greater than 30

          City Country  Math  Science
Name
Alice   London      UK    13       77
Mary   Florida     USA    26       49

In [208]:
student['Country'] # list a particular column of the entire dataframe

Name
John     India
Alice       UK
Bob         UK
Mary       USA
Krish    Spain
Name: Country, dtype: object

In [209]:
student['Country'].isin(['UK','USA'])

Name
John     False
Alice     True
Bob       True
Mary      True
Krish    False
Name: Country, dtype: bool

In [210]:
student[student['Country'].isin(['UK','USA'])] # returns the rows for which the condition is true

          City Country  Math  Science
Name
Alice   London      UK    13       77
Bob     London      UK    43       59
Mary   Florida     USA    26       49

In [211]:
student[~student['Country'].isin(['UK','USA'])]

         City Country  Math  Science
Name
John   Mumbai   India    42        6
Krish  Madrid   Spain    82       58

In [212]:
student[~student['Country'].isin(['UK','USA'])]['Country'] # choosing only certain attributes of the returned conditioned rows

Name
John     India
Krish    Spain
Name: Country, dtype: object

In [213]:
student[student['Country'].str.startswith('U')] # check based on starting letter of a string

          City Country  Math  Science
Name
Alice   London      UK    13       77
Bob     London      UK    43       59
Mary   Florida     USA    26       49

In [214]:
student[student['Country'].str.startswith('U')].index

Index(['Alice', 'Bob', 'Mary'], dtype='object', name='Name')

In [215]:
student['Notes'] = None # Adding a new column
Ustart=student[student['Country'].str.startswith('U')].index
student['Notes'][Ustart]="Starting with U"
student

<ipython-input-215-286b5face0a0>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  student['Notes'][Ustart]="Starting with U"

          City Country  Math  Science            Notes
Name
John    Mumbai   India    42        6             None
Alice   London      UK    13       77  Starting with U
Bob     London      UK    43       59  Starting with U
Mary   Florida     USA    26       49  Starting with U
Krish   Madrid   Spain    82       58             None